Revit 2027 API
BuiltInFailures.ViewFailures.CanNotDeleteLastOpenView Property
 Deleting of all open views in a project is not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CanNotDeleteLastOpenView { get; }
Public Shared ReadOnly Property CanNotDeleteLastOpenView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CanNotDeleteLastOpenView {
	FailureDefinitionId^ get ();
}
static member CanNotDeleteLastOpenView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace